/*Άσκηση 4: Να γραφεί ένα πρόγραμμα σε C++ που θα ζητά από τον χρήστη να εισάγει το μέγεθος ενός
πίνακα και έπειτα τα στοιχεία του πίνακα. Το πρόγραμμα θα πρέπει να χρησιμοποιεί δείκτες για τη
δέσμευση δυναμικής μνήμης για τον πίνακα, καθώς και για την πρόσβαση και εμφάνιση των
στοιχείων του πίνακα. Τέλος, το πρόγραμμα θα πρέπει να απελευθερώνει τη δεσμευμένη μνήμη
μετά την ολοκλήρωση της χρήσης του πίνακα.
Μετά την εκτέλεση του προγράμματος, τα βήματα θα είναι τα εξής:
1.Ο χρήστης θα καλείται να εισάγει το μέγεθος του πίνακα.
2.Ο χρήστης θα καλείται να εισάγει τα στοιχεία του πίνακα.
3.Το πρόγραμμα θα εμφανίζει τα στοιχεία που δώθηκαν από τον χρήστη.
4.Η μνήμη που δεσμεύθηκε για τον πίνακα θα απελευθερώνεται πριν το πρόγραμμα
ολοκληρωθεί.*/

#include <iostream>
using namespace std;


int main(){
	int N;
	cout<<"Dwse stoixeia tou pinaka : ";
	cin>>N;
	int *arr= new int[N];
	for(int i=0; i<N; i++){
		cout<<"dwse to "<<i+1<<"o stoixeio : ";
		cin>>*(arr+i);
	}
	for(int i=0; i<N; i++){
		cout<<*(arr+i)<<" ";
	}
	delete[] arr;
	return 0;
}




