/*Άσκηση 5: Να γραφεί ένα πρόγραμμα σε C++ που χρησιμοποιεί μια συνάρτηση με όνομα swap, η
οποία ανταλλάσσει τις τιμές δύο μεταβλητών. Το πρόγραμμα θα πρέπει να δηλώνει δύο μεταβλητές,
x και y, με αρχικές τιμές 5 και 10 αντίστοιχα. Στη συνέχεια, η συνάρτηση swap θα καλείται για να
ανταλλάξει τις τιμές των μεταβλητών x και y. Τέλος, το πρόγραμμα θα εμφανίζει τις τιμές των
μεταβλητών x και y πριν και μετά την ανταλλαγή των τιμών τους.
Μετά την εκτέλεση του προγράμματος, τα βήματα θα είναι τα εξής:
1. Οι μεταβλητές x και y θα δηλωθούν, με τις αρχικές τιμές 5 και 10 αντίστοιχα.
2. Η συνάρτηση swap θα καλείται για να ανταλλάξει τις τιμές των μεταβλητών x και y.
3. Το πρόγραμμα θα εμφανίζει τις τιμές των μεταβλητών x και y πριν και μετά την ανταλλαγή
τους.*/

#include <iostream>
using namespace std;

void swap(int *a,int *b){
	int temp=*a;
	*a=*b;
	*b=temp;
}
int main(){
	
	int x=5, y=10;
	cout<<"Prin: x="<<x<<" y="<<y<<endl;

	swap(&x,&y);
	cout<<"Meta: x="<<x<<" y="<<y<<endl;

	
	
	return 0;
}
