/*Άσκηση 2: Να γραφεί ένα πρόγραμμα σε C++ το οποίο να δέχεται έναν ακέραιο αριθμό που
αντιστοιχεί στον αριθμό των στοιχείων που θα εισαχθούν σε έναν πίνακα. Στη συνέχεια, να
δεσμεύεται δυναμική μνήμη για τον πίνακα χρησιμοποιώντας δείκτη. Ο χρήστης θα καλείται να
εισάγει τα στοιχεία του πίνακα, και στη συνέχεια το πρόγραμμα θα εμφανίζει τα στοιχεία αυτά.
Τέλος, η μνήμη που δεσμεύθηκε δυναμικά θα πρέπει να αποδεσμευθεί πριν το τέλος του
προγράμματος.*/

#include <iostream>
using namespace std;
int main(){
	int N;
	cout<<"Dwse stoixeia tou pinaka : ";
	cin>>N;
	int *arr= new int[N];
	for(int i=0; i<N; i++){
		cout<<"dwse to "<<i+1<<"o stoixeio : ";
		cin>>arr[i];
	}
	cout<<endl;
	for(int i=0; i<N; i++){
		cout<<arr[i]<<" ";
	}
	delete[] arr;
	
	return 0;
}
