'''2. Ένα κατάστημα αθλητικών ειδών παρέχει την εξής προσφορά σε όποια ποδοσφαιρική ομάδα
αγοράσει αθλητικά παπούτσια : εάν αγοραστούν πάνω από 18 ζευγάρια αθλητικών παπουτσιών,
τότε δεν χρεώνονται τα 3, αν αγοραστούν από 10 μέχρι και 18 ζευγάρια παπουτσιών τότε δεν
χρεώνονται τα δύο, αν αγοραστούν από 5 μέχρι και 9 ζευγάρια δεν χρεώνεται το 1 και για αγορά
λιγότερων από 5 δεν ισχύει η προσφορά. Να γραφεί πρόγραμμα σε Python το οποίο :
• Θα διαβάζει την τιμή που κοστίζει το ένα ζευγάρι αθλητικών παπουτσιών.
• Θα διαβάζει πόσα ζευγάρια αθλητικών παπουτσιών αγόρασε μία ποδοσφαιρική ομάδα.
• Θα καλεί συνάρτηση, που θα δέχεται την τιμή που κοστίζει το ένα ζευγάρι και το πλήθος των
ζευγαριών και θα υπολογίζει και θα εμφανίζει το ποσό που θα πληρώσει η ομάδα στο κατάστημα.'''

def f1(a,b):
	if b>18:
		b=b-3
	elif b>9:
		b=b-2
	elif b>4:
		b=b-1
	else:
		b=b
	print("H synoliki timi einai ",a*b)
#===========main=================================
price=float(input("Timi gia ena zeygari : "))
while price<=0:
	price=float(input("Timi gia ena zeygari : "))
plithos=int(input("Posa zeugaria phrate : "))
while plithos<=0:
	plithos=int(input("Posa zeugaria phrate : "))
f1(price,plithos)

