'''Οι ιδιοκτήτες ενός πάρκου άγριων ζώων στην Αφρική αποφασίσανε να καταγράψουν την ηλικία
του κάθε λιονταριού που υπάρχει σε αυτό. Να γραφεί πρόγραμμα που :
• Θα διαβάζει την ηλικία του κάθε λιονταριού σε χρόνια, μέχρι να διαβαστεί αρνητική ή
μηδενική ηλικία.
• Θα βρίσκει και θα εμφανίζει το πλήθος των λιονταριών με ηλικία πάνω από 10 χρόνια και
ξεχωριστά το πλήθος των λιονταριών με ηλικία κάτω από 4 χρονών.'''


over10=0
under4=0

age=int(input("Dose ilikia liontariou : "))
while age>0 :
	if age>10:
		over10+=1
	elif age<4:
		under4+=1 
	age=int(input("Dose ilikia liontariou : "))
print("Kato ton 4 eton einai",under4,"kai panw ton 10 einai",over10,)
