/*Άσκηση 7: Στόχος της άσκησης είναι η δημιουργία ενός προγράμματος σε C++, το οποίο να
χρησιμοποιεί μια κλάση Point για την αναπαράσταση σημείων σε ένα δισδιάστατο χώρο. Η κλάση
Point πρέπει να περιλαμβάνει τα εξής:
Ιδιωτικά μέλη:
Δύο ακέραιες μεταβλητές x και y, που αναπαριστούν τις συντεταγμένες ενός σημείου.
Δημόσιες μέθοδοι:
1. Έναν constructor για την αρχικοποίηση των συντεταγμένων του σημείου.
2. Μια μέθοδο print() που εκτυπώνει τις συντεταγμένες του σημείου.
3. Δύο μέθοδους setX() και setY() για την αλλαγή των συντεταγμένων x και y αντίστοιχα.
Στη συνέχεια, στην main συνάρτηση, το πρόγραμμα πρέπει να δημιουργεί ένα αντικείμενο της
κλάσης Point με χρήση δείκτη και να χρησιμοποιεί τον δείκτη για να καλεί τις μεθόδους print(), setX()
και setY() του αντικειμένου.*/

#include <iostream>
using namespace std;

class Point{
	private:
		int x;
		int y;
	public:
		Point(int a,int b):x(a),y(b){}
		void print(){
			cout<<"x:"<<x<<", y:"<<y<<endl;
		}
		void setX(int newX){
			x=newX;
		}	
		void setY(int newY){
			y=newY;
		}
};
int main (){
	Point *ptr=new Point(3,4);
	ptr->print();
	ptr->setX(7);
	ptr->setY(9);
	ptr->print();
	delete ptr;
	
	return 0;
}
