'''Κατά την είσοδο σε ένα μουσείο, ένας επισκέπτης πληρώνει ένα εισιτήριο αξίας
8 €. Όταν όμως το μουσείο επισκέπτεται μία ομάδα επισκεπτών, τότε, εάν η
ομάδα αποτελείται από περισσότερα από 7 άτομα, πληρώνει ένα εισιτήριο λιγότερο.
Να γραφεί πρόγραμμα που κατά την επίσκεψη μίας ομάδας επισκεπτών
στο μουσείο θα διαβάζει τον αριθμό ατόμων από τα οποία αποτελείται η ομάδα,
να υπολογίζει και να εμφανίζει το ποσό που θα καταβάλλει όλη η ομάδα μαζί ως
αντίτιμο για την έκδοση των εισιτηρίων.'''
x=int(input('posa atoma : '))
if x>7:
    x=x-1
print("Tha plhrwsete ",x*8," eura")
