'''3. Ένας ιδιωτικός παθολόγος ιατρός δέχεται στο ιατρείο του ασθενείς που είναι ασφαλισμένοι στους
ασφαλιστικούς οργανισμούς «Α» , «Β» και «Γ». Για τον κάθε ασθενή που δέχεται λαμβάνει από
τον αντίστοιχο ασφαλιστικό οργανισμό του ασθενούς ένα ποσό που είναι 30 € από τον οργανισμό
«Α», 25 € από τον οργανισμό «Β» και 20 € από τον οργανισμό «Γ». Να γραφεί πρόγραμμα σε
Python το οποίο :
• Για κάθε έναν ασθενή που δέχεται ο παθολόγος ιατρός στο ιατρείο του :
◦ Θα διαβάζει το όνομά του. Θεωρήστε ότι το όνομα γράφεται με κεφαλαία γράμματα της ελ-
ληνικής αλφαβήτου.
◦ Θα καλεί τη συνάρτηση check, που :
▪ Θα διαβάζει τον ασφαλιστικό οργανισμό που ανήκει, εξασφαλίζοντας ότι αυτός λαμβάνει
μόνο τις τιμές «Α» ή «Β» ή «Γ».
▪ Θα υπολογίζει και θα επιστρέφει το ποσό των χρημάτων που θα εισπράξει ο ιατρός από
τον ασφαλιστικό οργανισμός του ασθενούς.
▪ Το τέλος του διαβάσματος θα γίνει με την εισαγωγή της λέξης «ΤΕΛΟΣ» στο όνομα του
ασθενούς.
• Θα υπολογίζει και θα εμφανίζει το ποσό των χρημάτων που θα εισπράξει ο ιατρός από όλους
τους ασθενείς.'''
def check():
	org=str(input("Se poion organismo anikei : "))
	while org!="A" and org!="B" and org!="C" and org!="a" and org!="b" and org!="c":
		org=str(input("Se poion organismo anikei : "))
	if org=="A" or org=="a":
		poso=30	
	elif org=="B" or org=="b":
		poso=25
	else: 	
		poso=20
	return poso
#=====================main======================
total=0
name=input("Dwse onoma asthenous : ")
while name!="TELOS" and name!="telos":
	xr=check()
	total+=xr
	name=input("Dwse onoma asthenous : ")
print("Tha eispraksei",total,"euro.")

