'''Το αρχείο κειμζνου onomata.txt κζλουμε να ζχει τθν δομι όπωσ φαίνεται δίπλα:
Συνεπϊσ ςε κάκε γραμμι οι τρεισ πρϊτοι χαρακτιρεσ περιζχουν ζνα ακζραιο αρικμό που είναι
θ θλικία του ατόμου του οποίου το όνομα ακολουκεί Αποδεκτζσ θλικίεσ 10-999
Γράψτε πρόγραμμα Python το οποίο να διαβάηει από το χριςτθ ονόματα και θλικίεσ μζχρι να
δοκεί ωσ όνομα το 'The end' και να τα γράφει ςτο αρχείο, γραμμι προσ γραμμι'''

f=open("onomata3.txt","w")
name=input("Name : ")
while name!= "The end":
	age="Ilikia : "
	f.write(str(age)) 
