'''ο αρχείο κειμζνου onomata.txt κζλουμε να ζχει τθν δομι όπωσ φαίνεται δίπλα
Συνεπϊσ οι γραμμζσ που βρίςκονται ςε περιττζσ κζςεισ περιζχουν ονόματα ατόμων και οι
γραμμζσ που βρίςκονται ςε άρτιεσ κζςεισ περιζχουν ςε ακζραιο αρικμό τθν θλικία του
αντίςτοιχου ατόμου.
Γράψτε πρόγραμμα Python το οποίο να διαβάηει από το χριςτθ 30 ονόματα και θλικίεσ και
να τα προςκζτει ςτο αρχείο, γραμμι προσ γραμμι.'''

f=open("onomata1.txt","w")
for i in range(5):
	name=input("Onoma : ")
	age=int(input("Ilikia : "))
	f.write(name+"\n"+str(age)+"\n")
f.close()
