''''Σε ένα ιδιωτικό πάρκινγκ αυτοκινήτων η χρέωση είναι 0.03 € ανά λεπτό παραμονής σε αυτό. Να
αναπτύξετε πρόγραμμα ώστε για κάθε αυτοκίνητο που εξέρχεται από το πάρκινγκ :
• Να διαβάζει τον αριθμό αυτοκινήτου (ο αριθμός αυτοκινήτου μπορεί να περιέχει τόσο
γράμματα όσο και αριθμούς) και τα λεπτά παραμονής σε αυτό.
• Να υπολογίζει και να εμφανίζει το ποσό που πρέπει να πληρώσει ο κάτοχος του αυτοκινήτου.
• Το διάβασμα θα τερματίζει όταν δοθεί ως αριθμός αυτοκινήτου το κενό.'''

pinakida=input("Dwse noumero pinakidas : ")
while pinakida!=' ':
    minute=int(input("Posa lepta emeine : "))
    print("to aytokinhto me arithmo kykloforias",pinakida,"prepei na plhrosei",minute*0.03,"euro")
    pinakida=input("Dwse noumero pinakida : ")
