'''10. Για τη στελέχωση μιας ιατρικής ομάδας ενός ερευνητικού ιδρύματος, προσήλθε μεγάλος
αριθμός υποψηφίων που ο κάθε ένας υποβλήθηκε σε 16 δοκιμασίες και βαθμολογήθηκε
ξεχωριστά για την κάθε μία με ένα βαθμό από το 1 έως το 100. Ο τελικός βαθμός του κάθε
υποψηφίου προήλθε από τον μέσο όρο των 5 καλύτερων βαθμών που έλαβε. Να αναπτύξετε
πρόγραμμα σε Python το οποίο :
• Να διαβάζει το ονοματεπώνυμο ενός υποψηφίου.
• Να διαβάζει τους βαθμούς του στις 16 δοκιμασίες και να τις καταχωρίζει στη λίστα Β. Δεν
απαιτείται έλεγχος των δεδομένων εισόδου.
• Να βρίσκει τον τελικό βαθμό του υποψηφίου.
Τα παραπάνω να επαναλαμβάνονται, μέχρι να δοθεί ως ονοματεπώνυμο η λέξη «ΤΕΛΟΣ».
• Να εμφανίζει το ονοματεπώνυμο του υποψηφίου με τον μεγαλύτερο τελικό βαθμό. Να
λάβετε υπόψη την περίπτωση κατά την οποία μπορεί να μην έχει διαβαστεί κανένας
υποψήφιος.
Θεωρείστε ότι δεν υπάρχουν ίδιοι τελικοί βαθμοί και ότι το ονοματεπώνυμο γράφεται με
κεφαλαία γράμματα της ελληνικής αλφαβήτου.'''
N=5
names=[]
B=[]
TB=[]
name=input("Dwse onomateponumo ypopsifiou : ")
while name != "TELOS":
		names.append(name)
		for i in range(16):
			B.append(int(input("Dwse "+str(i+1)+"o bathmo : ")))
		B.sort()
		MO=[]
		for i in range(11,16,1):
			MO.append(B[i])
		mo=sum(MO)/5
		print("O telikos bathmos tou ",name," einai : ",mo)
		TB.append(mo)
		MO.clear()
		name=input("Dwse onoma ypopsifiou : ")
if len(TB)==0:
	print("Den dothikan ypopsifioi.")
else:
	print("To onomateponumo tou ypospifiou me ton megalutero bathmo einai : "+str(names[TB.index(max(TB))])+" me teliko bathmo : ",max(TB))
