'''Η εύρεση των αριθμών ημερών ενός μήνα του έτους γίνεται χρησιμοποιώντας τις
παρακάτω πληροφορίες :
• Όταν το έτος είναι δίσεκτο, ο Φεβρουάριος έχει 29 ημέρες, διαφορετικά, έχει
28 ημέρες.
• Για τους μήνες μέχρι τον Ιούλιο, οι μονοί μήνες έχουν 31 ημέρες και οι ζυγοί
30 ημέρες.
• Για τους μήνες μετά τον Ιούλιο, οι ζυγοί μήνες έχουν 31 ημέρες και οι μονοί
30 ημέρες.
• Ένα έτος είναι δίσεκτο, όταν ο αριθμός του είναι πολλαπλάσιος του 4, αλλά
όχι του 100, ή είναι πολλαπλάσιος του 400.
Να γραφεί πρόγραμμα που θα διαβάζει τον αριθμό ενός μήνα (1-12) και το έτος
στο οποίο ανήκει ο μήνας. Να υπολογίζει και να εμφανίζει τον αριθμό ημερών
που έχει ο μήνας που διαβάστηκε.'''
y=int(input('dwse xronologia : '))
m=int(input('dwse mhna : '))

if m==2:
      d=28
if m==2 and y%4==0 and y%100!=0 or y%400==0:
      d=29
if m<=7 and m%2==1 and m!=2:
      d=31
if m<=7 and m%2==0 and m!=2:
      d=30
if m>7  and m%2==1:
      d=30
if m>7  and m%2==0:
      d=31
print("meres : ", d);
