'''Strings test_02
Ένα ηλεκτρονικό κατάστημα καταγράφει τις πωλήσεις των προϊόντων του
στο τέλος της ημέρας. Κάθε προϊόν χαρακτηρίζεται από έναν κωδικό. Ο
κωδικός αποτελείται από δύο (2) κεφαλαία γράμματα, τα οποία
αντιστοιχούν στην χώρα παραγωγής του προϊόντος, και ακολουθείται από
οκτώ (8) ψηφία. Ο κωδικός έχει την παρακάτω δομή (ενδεικτικά):
GR12467078.
Να αναπτύξετε πρόγραμμα σε γλώσσα προγραμματισμού Python το
οποίο:
Δ1. Για κάθε προϊόν:
α) Να διαβάζει τον κωδικό του και να τον καταχωρίζει σε λίστα με όνομα
CODE.
β) Να διαβάζει την τιμή πώλησης του προϊόντος.
γ) Να διαβάζει το πλήθος των τεμαχίων που πωλήθηκαν.
Η εισαγωγή των στοιχείων θα τερματίζεται, όταν δοθεί ως κωδικός
προϊόντος η λέξη "ΤΕΛΟΣ". Θεωρήστε ότι καταχωρίζονται τουλάχιστον
δύο προϊόντα με μη μηδενικές τιμές πώλησης και μη μηδενικό πλήθος
τεμαχίων.
Δ2. Να υπολογίζει το ποσό των εσόδων για κάθε προϊόν και να το
καταχωρίζει σε λίστα με όνομα ESODA.
Δ3. Να διαβάζει τον κωδικό ενός προϊόντος και να εμφανίζει τα έσοδα
από τις πωλήσεις του. Αν ο κωδικός δεν υπάρχει στη λίστα CODE, να
εμφανίζει κατάλληλο μήνυμα. Η αναζήτηση του κωδικού να γίνεται με
κλήση της συνάρτησης anazitisi, όπως περιγράφεται στo ερώτημα Δ4.
Δ4. Να υλοποιήσετε τη συνάρτηση με όνομα anazitisi, η οποία να
δέχεται τον κωδικό του προϊόντος και τη λίστα CODE, και να επιστρέφει τη
θέση στην οποία βρίσκεται ο κωδικός στη λίστα CODE, διαφορετικά να
επιστρέφει την τιμή ‐1.
Δ5. Να υπολογίζει και να εμφανίζει το ποσοστό των εσόδων των
ελληνικών προϊόντων, των οποίων ο κωδικός αρχίζει με GR, στο σύνολο
των εσόδων όλων των προϊόντων.
Μπάρκος Γεώργιος 1...'''

def anazitisi(A):
    code=input("Dose kodiko proiontos : ")
    if code in A:
        return A.index(code)
    else:
        return -1
#=======================================================================    
CODE=[]
ESODA=[]
TEMAXIA=[]
TIMI=[]
code=input("Dose kodiko proiontos : ")
while code!="TELOS":
    CODE.append(code)
    price=float(input("Dose timi polisis tou proiontos "))
    TIMI.append(price)
    count=int(input("Dose plhthos temaxion pou poulithikan tou proiontos "))
    TEMAXIA.append(count)
    esoda=price*count
    ESODA.append(esoda)
    code=input("Dose kodiko proiontos : ")
flag=anazitisi(CODE)
if flag==-1:
    print("O kodikos den einai sthn lista CODE")
else:
    print("Ta esoda tou proiontos "+str(CODE[flag])+" einai",ESODA[flag])
GRESODA=0
for i  in range(len(CODE)):
    if CODE[i][0:2]=="GR":
        GRESODA+=ESODA[i]
print("Ta esoda ton ellhnikon proionton einai ",GRESODA)


    
