/*Να γραφεί ένα πρόγραμμα το οποίο να εμφανίζει στην οθόνη ένα ορθογώνιο με αστεράκια. Το μέγεθος του ορθογωνίου θα πρέπει να είναι μεταβλητό. Το ύψος του σε γραμμές και το πλάτος του σε αστερίσκους θα δίνεται από τον χρήστη. Για παράδειγμα, το ορθογώνιο του παραδείγματος έχει ύψος 7 γραμμών και πλάτος 10. */

#include <iostream>
using namespace std;
int main(){
	int i,j,gr,st;
	cout << "Δώσε ύψος και πλάτος ορθογωνίου : ";
	cin >> gr >> st;
	for (j=1;j<=st;j++) cout << '*';
	cout << endl;
	for (i=1;i<=gr-2;i++){
		cout << '*';
		for (j=1;j<=st-2;j++)
		cout << ' ';
		cout << '*';
		cout << endl;
		}
	for (j=1;j<=st;j++) cout << '*';
	cout << endl;
	return 0;
	}
