#include<stdio.h>
int main()
{

    float gr,price,tt;
    char c;
int    a=1;
  int  b=2;
printf("poion cafe : "); scanf("%s", &c);
printf("posa grammaria : "); scanf("%f", &gr);

if ((c==1)&&(gr<=400))
{
    price=0.0095;}
else{
    price=0.0085;
    }
if ((c==2)&&(gr<=500))
{

    price=0.012;}
else{
    price=0.01;
}
tt=price*gr;
printf("%f", tt);
return 0;
}
//αν καποιος αγορασει τον Α καφε ως 400 γραμμ τοτε θα δωσει 9.5 κιλο, ενω για περισσοτερα γραμμ 8.5 το κιλο. Αν αγορασει ως 500γραμμ απο τον Β καφε θα δωσει 12 το κιλο ενω για μεγαλυτερη ποσοτηττα 10
//Κ. Λ. λέει:προγραμμα που διαβαζει το ειδος του καφε , την αντιστοιχη ποσοτητα,το ποσο που θα πληρωσει και ποιο συμφερει περισσοτερο
