'''Ο αγροτικός συνεταιρισμός ενός χωριού της Ελλάδας απαριθμεί 500 μέλη-αγρότες. Ο
κάθε αγρότης καλλιεργεί στο χωράφι του το προϊόν «Α» ή το προϊόν «Β» και κάθε χρόνο
παραδίδει στον συνεταιρισμό τις ποσότητες σε κιλά που παρήγαγε από το κάθε ένα
προϊόν. Να υλοποιηθεί πρόγραμμα που :
• Για κάθε ένα από τα 500 μέλη του συνεταιρισμού, να διαβάζει το είδος του
προϊόντος (Α ή Β) που παρήγαγε, και τα κιλά που παρέδωσε στον συνεταιρισμό.
(ακέραια τιμή).
• Να υπολογίζει και να εμφανίζει τη συνολική ποσότητα που συγκέντρωσε ο
συνεταιρισμός από το προϊόν «Α», και τη συνολική ποσότητα που συγκέντρωσε από
το προϊόν «Β».
Παρατήρηση : Κάθε αγρότης-μέλος παραδίδει μόνο ένα από τα δύο προϊόντα.'''

sumA=0
sumB=0
for i in range(500):
    eidos=input("Dwse eidos : ")
    kila=int(input("Dwse kila : "))
    if (eidos=="A") or (eidos=="a"):
        sumA+=kila
    else:
        sumB+=kila
print("A eidos : ",sumA)
print("B eidos : ",sumB)
