/*2) Να γραφεί ένα πρόγραμμα το οποίο να αποφασίζει αν ένα έτος είναι δίσεκτο ή όχι, σύμφωνα με τα εξής:
• Θα ζητάει να πληκτρολογηθεί το έτος. 
• Θα εμφανίζει τη λέξη δίσεκτο αν το έτος είναι δίσεκτο και τη λέξη κανονικό αν δεν είναι. 
• Δίσεκτο είναι ένα έτος όταν διαιρείται ακριβώς με το 4, όμως τα έτη που διαιρούνται ακριβώς με το 100 δεν είναι δίσεκτα, εκτός αν διαιρούνται ακριβώς με το 400.*/

#include <iostream>
using namespace std;
int main(){
	int year;
	cout<<"Dwse xronologia : ";
	cin>>year;
	if((year%4==0 and year%100 !=0) or (year%400==0)){		
		cout<<"Disekto";
		}
	else
		cout<<"Oxi disekto";
	return 0;
	}
